In [192]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [193]:
dataset = pd.read_csv("SalariesData.csv")

In [194]:
dataset

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L
...,...,...,...,...,...,...,...,...,...,...,...,...
602,602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

In [195]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 607 entries, 0 to 606
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          607 non-null    int64
 1   work_year           607 non-null    int64
 2   experience_level    607 non-null    object
 3   employment_type     607 non-null    object
 4   job_title           607 non-null    object
 5   salary              607 non-null    int64
 6   salary_currency     607 non-null    object
 7   salary_in_usd       607 non-null    int64
 8   employee_residence  607 non-null    object
 9   remote_ratio        607 non-null    int64
 10  company_location    607 non-null    object
 11  company_size        607 non-null    object
dtypes: int64(5), object(7)
memory usage: 57.0+ KB

In [196]:
dataset.job_title.nunique()

50

In [197]:
dataset.notnull().value_counts()

Unnamed: 0  work_year  experience_level  employment_type  job_title  salary  salary_currency  salary_in_usd  employee_residence  remote_ratio  company_location  company_size
True        True       True              True             True       True    True             True           True                True          True              True            607
dtype: int64

In [198]:
dataset.salary.nunique()

272

In [199]:
dataset.company_size.nunique()

3

In [200]:
dataset.company_location.nunique()

50

In [201]:
dataset.remote_ratio.nunique()

3

In [202]:
dataset.salary_currency.nunique()

17

In [203]:
dataset.salary.mean()

324000.0626029654

In [204]:
dataset.salary_in_usd.nunique()

369

In [205]:
dataset.experience_level.nunique()

4

In [206]:
dataset.employment_type.nunique()

4

In [207]:
dataset.columns.nunique()

12

In [208]:
dataset.head()

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

In [209]:
dataset = dataset.drop("Unnamed: 0", axis=1)

In [210]:
dataset.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

In [211]:
x = dataset.iloc[:, :-1].values

In [212]:
print(x)

[[2020 'MI' 'FT' ... 'DE' 0 'DE']
 [2020 'SE' 'FT' ... 'JP' 0 'JP']
 [2020 'SE' 'FT' ... 'GB' 50 'GB']
 ...
 [2022 'SE' 'FT' ... 'US' 0 'US']
 [2022 'SE' 'FT' ... 'US' 100 'US']
 [2022 'MI' 'FT' ... 'IN' 100 'US']]

In [213]:
y = dataset.iloc[:, -1].values

In [214]:
print(y)

['L' 'S' 'M' 'S' 'L' 'L' 'S' 'L' 'L' 'S' 'S' 'L' 'M' 'L' 'L' 'L' 'S' 'S'
 'M' 'M' 'M' 'L' 'L' 'M' 'L' 'L' 'L' 'S' 'L' 'L' 'S' 'L' 'L' 'M' 'L' 'L'
 'L' 'L' 'S' 'S' 'S' 'L' 'M' 'L' 'L' 'S' 'S' 'L' 'L' 'L' 'S' 'L' 'S' 'L'
 'S' 'M' 'M' 'M' 'L' 'M' 'L' 'M' 'S' 'L' 'S' 'S' 'S' 'M' 'S' 'S' 'S' 'S'
 'L' 'L' 'L' 'L' 'M' 'M' 'L' 'M' 'L' 'L' 'L' 'S' 'L' 'L' 'M' 'L' 'L' 'S'
 'L' 'S' 'L' 'L' 'L' 'L' 'S' 'L' 'M' 'S' 'L' 'L' 'L' 'L' 'L' 'L' 'L' 'S'
 'M' 'L' 'L' 'M' 'S' 'M' 'L' 'L' 'L' 'M' 'S' 'L' 'M' 'M' 'M' 'L' 'M' 'L'
 'S' 'S' 'S' 'L' 'S' 'M' 'M' 'M' 'S' 'M' 'S' 'S' 'L' 'M' 'L' 'L' 'L' 'S'
 'L' 'M' 'M' 'L' 'L' 'S' 'S' 'M' 'L' 'L' 'L' 'L' 'M' 'L' 'M' 'S' 'L' 'M'
 'L' 'L' 'M' 'L' 'L' 'L' 'S' 'L' 'L' 'L' 'S' 'L' 'L' 'L' 'S' 'L' 'S' 'S'
 'L' 'L' 'L' 'L' 'M' 'M' 'M' 'S' 'S' 'S' 'L' 'M' 'S' 'L' 'L' 'L' 'S' 'L'
 'L' 'S' 'M' 'M' 'L' 'S' 'L' 'S' 'L' 'M' 'L' 'L' 'L' 'S' 'S' 'L' 'M' 'L'
 'S' 'L' 'M' 'L' 'L' 'L' 'M' 'L' 'L' 'S' 'S' 'L' 'L' 'M' 'L' 'S' 'L' 'L'
 'L' 'S' 'M' 'M' 'M' 'M' 'L' 'L' 'L' 'L' 'S' 'L' 'L' 'M' 'L' 'M' 'L' 'S'
 'L' 'M' 'L' 'M' 'L' 'M' 'L' 'L' 'L' 'L' 'S' 'L' 'S' 'S' 'M' 'M' 'M' 'M'
 'L' 'M' 'L' 'S' 'M' 'M' 'L' 'L' 'L' 'L' 'L' 'L' 'L' 'M' 'L' 'L' 'L' 'L'
 'L' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M'
 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'L'
 'L' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M'
 'M' 'M' 'M' 'M' 'M' 'M' 'L' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M'
 'M' 'M' 'M' 'M' 'L' 'M' 'M' 'S' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'S' 'M' 'M'
 'M' 'M' 'M' 'M' 'M' 'M' 'L' 'M' 'L' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M'
 'M' 'M' 'L' 'L' 'L' 'L' 'M' 'M' 'M' 'M' 'S' 'L' 'M' 'M' 'M' 'M' 'M' 'M'
 'M' 'M' 'M' 'L' 'M' 'L' 'L' 'M' 'M' 'M' 'M' 'M' 'L' 'M' 'L' 'M' 'M' 'M'
 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'L' 'M' 'L' 'L' 'M' 'L'
 'M' 'M' 'L' 'S' 'M' 'L' 'M' 'M' 'M' 'L' 'L' 'L' 'L' 'M' 'M' 'M' 'L' 'M'
 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'S' 'S' 'M' 'M' 'M' 'M'
 'M' 'M' 'M' 'M' 'M' 'S' 'L' 'M' 'M' 'M' 'M' 'M' 'L' 'L' 'L' 'S' 'L' 'L'
 'M' 'M' 'L' 'L' 'L' 'L' 'S' 'L' 'S' 'S' 'M' 'S' 'M' 'M' 'L' 'L' 'M' 'M'
 'S' 'L' 'L' 'L' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M'
 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'L' 'L' 'M' 'M' 'M' 'M' 'M' 'M'
 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M'
 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M'
 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'M' 'L']

In [215]:
dataset.nunique()

work_year               3
experience_level        4
employment_type         4
job_title              50
salary                272
salary_currency        17
salary_in_usd         369
employee_residence     57
remote_ratio            3
company_location       50
company_size            3
dtype: int64

In [216]:
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder

In [217]:
ct = ColumnTransformer(transformers=[('encoder', OneHotEncoder(), [1])],remainder='passthrough')

x = np.array(ct.fit_transform(x))

In [218]:
x

array([[0.0, 0.0, 1.0, ..., 'DE', 0, 'DE'],
       [0.0, 0.0, 0.0, ..., 'JP', 0, 'JP'],
       [0.0, 0.0, 0.0, ..., 'GB', 50, 'GB'],
       ...,
       [0.0, 0.0, 0.0, ..., 'US', 0, 'US'],
       [0.0, 0.0, 0.0, ..., 'US', 100, 'US'],
       [0.0, 0.0, 1.0, ..., 'IN', 100, 'US']], dtype=object)

In [219]:
# ct = ColumnTransformer(transformers=[('encoder', OneHotEncoder(), [2])], remainder='passthrough')
#
# x = np.array(ct.fit_transform(x))
# x